# .2 השתמש בלולאת for והדפס:
# - את כל המספרים השלמים מ- 0 ועד 10 כ ולל
# - את כל המספרים הזוגיים מ 40- ועד 88 כולל
# - את כל המספרים המתחלקים ב7-  ללא שארית מ77- ועד 105 כולל
# - את כל המספרים המתחלקים ב- 3 ללא שארית מ 99- ועד 66 בסדר יורד

# # את כל המספרים השלמים מ- 0 ועד 10 כ ולל
for i in range(0, 10 + 1):
    print(i, end= " ")
print()
#
# # #את כל המספרים הזוגיים מ 40- ועד 88 כולל
for x in range(40, 88 + 2, 2):
    print(x, end= " ")
print()
#
# # את כל המספרים המתחלקים ב7- ללא שארית מ77- ועד 105 כולל
for a in range(77, 105 + 1):
    if a % 7 == 0:
        print(a, end= " ")
print()

# את כל המספרים המתחלקים ב- 3 ללא שארית מ 99- ועד 66 בסדר יורד

for t in range(99, 65, -3):
    print(t, end=" ")
print()

